{
    "roles": [
      {
        "name": "system",
        "description": "Le système est responsable de la gestion structurelle et technique du projet. Il fournit les ressources, les contextes et les tâches à exécuter.",
        "tasks": [
          {
            "task": "Gérer la configuration initiale des ressources du projet",
            "actions": [
              "Charger les fichiers de configuration ('index.html', 'style.css', 'layout.json', 'script.js')",
              "Fournir des informations sur l'environnement de développement Fullstack",
              "Optimiser les prompts pour la plateforme IA"
            ],
            "process": "Initialisation des ressources du projet"
          },
          {
            "task": "Surveiller le processus et ajuster les ressources",
            "actions": [
              "Gérer les itérations du modèle IA",
              "Surveiller les performances du modèle",
              "Optimiser l'infrastructure technique"
            ],
            "process": "Gestion continue des ressources techniques"
          }
        ]
      },
      {
        "name": "assistant",
        "description": "L'assistant aide l'utilisateur en fournissant des suggestions et en interprétant les tâches soumises. Il agit comme un facilitateur entre l'utilisateur et le système.",
        "tasks": [
          {
            "task": "Guider l'utilisateur dans la création de tâches",
            "actions": [
              "Proposer des suggestions pour les tâches en fonction des besoins de l'utilisateur",
              "Interpréter les demandes de l'utilisateur et formuler des réponses claires",
              "Aider à structurer les tâches complexes en étapes plus simples"
            ],
            "process": "Assistance à la gestion des tâches"
          },
          {
            "task": "Faciliter l'interaction avec le système",
            "actions": [
              "Transmettre les informations du système à l'utilisateur",
              "Interpréter les résultats du système et les communiquer de manière accessible",
              "Fournir des recommandations d'amélioration"
            ],
            "process": "Facilitation de la communication utilisateur-système"
          }
        ]
      },
      {
        "name": "user",
        "description": "L'utilisateur soumet des tâches ou des requêtes au système et interagit avec l'assistant pour accomplir ses objectifs. Il reçoit des suggestions et des résultats basés sur ses instructions.",
        "tasks": [
          {
            "task": "Soumettre des tâches et des objectifs",
            "actions": [
              "Spécifier les objectifs SMART",
              "Donner des instructions pour configurer et exécuter les processus",
              "Évaluer les suggestions et résultats fournis par l'assistant"
            ],
            "process": "Soumission des objectifs et des tâches"
          },
          {
            "task": "Analyser et valider les résultats",
            "actions": [
              "Examiner les rapports et les résultats produits",
              "Donner des feedbacks sur les suggestions de l'assistant",
              "Ajuster les tâches ou objectifs en fonction des résultats"
            ],
            "process": "Validation des résultats"
          }
        ]
      }
    ]
  }
  